'''
3. Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.

'''

str_1 = input()
str_2 = input()

count = str_1.count(str_2)

# Count - считает количество того, сколкьо раз попоадается строка.

print(count)